/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stdlib.h"
#include "math.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
typedef struct {
    float Kp;
    float Ki;
    float Kd;
    float integral;      // Thành phần tích phân tích lũy
    float prevError;     // Sai số lần trước
    float outMin;        // Giới hạn đầu ra Min
    float outMax;        // Giới hạn đầu ra Max
    float dt;            // Thời gian lấy mẫu (giây)
} PID_Controller;

/*typedef struct __attribute__((packed)) {
    uint8_t header;       // 0xAA
    
    float setpoint_pos;   // 1
    int32_t current_pos;  // 2
    float target_vel;     // 3
    float current_vel;    // 4
    float rpm_motor;      // 5
    float rpm_output;     // 6
    
    float v_Kp;           // 7
    float v_Ki;           // 8
    float v_Kd;           // 9
    
    float p_Kp;           // 10
    float p_Ki;           // 11
    float p_Kd;           // 12
    
    uint8_t checksum;
    uint8_t footer;       // 0x55
} TelemetryData; */

typedef struct __attribute__((packed)) {
    uint8_t header;       // 0xAA
    
    float setpoint_pos;   // 1
    int32_t current_pos;  // 2
    float target_vel;     // 3
    float current_vel;    // 4
    float rpm_motor;      // 5
    float rpm_output;     // 6
    
    float v_Kp;           // 7
    float v_Ki;           // 8
    float v_Kd;           // 9
    
    float p_Kp;           // 10
    float p_Ki;           // 11
    float p_Kd;           // 12
    
    float pwm_out;        // 13
    float current_ma;     // 14 <--- BẮT BUỘC PHẢI CÓ DÒNG NÀY
    
    uint8_t checksum;
    uint8_t footer;       // 0x55
} TelemetryData;

typedef struct __attribute__((packed)) {
    uint8_t header;    // 0xBB
    uint8_t cmd_id;    // 1: Setpoint, 2: Kp, 3: Ki, 4: Kd, 5: Enable/Disable
    float value;       // Giá trị lệnh
    uint8_t checksum;
    uint8_t footer;    // 0xCC
} ControlPacket;
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define PWM_MAX 4199    
#define INPUT_MAX 1000

// Thông số vật lý motor JGB37-520
#define PPR_MOTOR 11            
#define ENCODER_MODE 4          
#define GEAR_RATIO 30.0f        
#define PULSES_PER_REV_MOTOR (PPR_MOTOR * ENCODER_MODE) // 44 xung/vòng

// Ngưỡng Fuzzy (Dải 13200 xung như bạn yêu cầu)
#define E_NB -13200.0f
#define E_NS -1000.0f
#define E_ZE 0.0f
#define E_PS 1000.0f
#define E_PB 13200.0f

#define DE_NB -5000.0f
#define DE_NS -1000.0f
#define DE_ZE 0.0f
#define DE_PS 1000.0f
#define DE_PB 5000.0f

// Biên độ điều chỉnh Fuzzy cho nghiên cứu
#define MAX_D_KP 2.5f   
#define MAX_D_KI 0.5f   
#define MAX_D_KD 0.3f  

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

